Core/src/Documents/AzRyКонвертацияВалюты/AzRyКонвертацияВалюты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>AzRyКонвертацияВалюты</name>
  <registerRecords>AccumulationRegister.ПлатежныйКалендарь</registerRecords>
  <registerRecords>AccountingRegister.Управленческий</registerRecords>
  <registerRecords>AccumulationRegister.ДенежныеСредства</registerRecords>
  <registerRecords>AccumulationRegister.ДоходыИРасходы</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>НалогообложениеНДС</name>
    <type>
      <types>EnumRef.ТипыНалогообложенияНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>БанковскийСчет1</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>КурсВалюты1</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Касса1</name>
    <type>
      <types>CatalogRef.Кассы</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма1</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БанковскийСчет2</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КурсВалюты2</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Касса2</name>
    <type>
      <types>CatalogRef.Кассы</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма2</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьДатаКурсаВалюты</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьКратность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Удалить_Валюта1</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Удалить_Валюта2</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Удалить_ВалютаУчета</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийРасходСоСчета</types>
      <types>EnumRef.AzRyВидыОперацийКонвертацияВалюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаОпераций</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеКонвертаций</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетДебетРасход</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетКредитПриход</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипыКонвертацияВалюты</name>
    <type>
      <types>EnumRef.AzRyТипыКонвертацияВалюты</types>
    </type>
  </attributes>
  <attributes>
    <name>AzRyПроекты</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>AzRyJiraCode</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Корреспонденция</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>Статья</name>
    <type>
      <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    </type>
  </attributes>
</mdclass:Document>

Core/src/Enums/ТипыДенежныхСредств/ТипыДенежныхСредств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыДенежныхСредств</name>
  <enumValues>
    <name>Наличные</name>
  </enumValues>
  <enumValues>
    <name>Безналичные</name>
  </enumValues>
  <enumValues>
    <name>AzRyРасходнаяНакладнаяНаличные</name>
  </enumValues>
  <enumValues>
    <name>AzRyРасходнаяНакладнаяБезналичные</name>
  </enumValues>
</mdclass:Enum>

Core/src/Enums/СтатусыУтвержденияПлатежей/СтатусыУтвержденияПлатежей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыУтвержденияПлатежей</name>
  <enumValues>
    <name>Утвержден</name>
  </enumValues>
  <enumValues>
    <name>НеУтвержден</name>
  </enumValues>
</mdclass:Enum>

Core/src/Enums/AzRyТипыКонвертацияВалюты/AzRyТипыКонвертацияВалюты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>AzRyТипыКонвертацияВалюты</name>
  <enumValues>
    <name>Безналичные</name>
  </enumValues>
  <enumValues>
    <name>Наличные</name>
  </enumValues>
</mdclass:Enum>

Core/src/Documents/AzRyКонвертацияВалюты/ManagerModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// РАСХОД СО СЧЕТА

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаДенежныеСредстваРасходСоСчета(ДокументСсылкаРасходСоСчета, СтруктураДополнительныеСвойства)
			
	ТД = Новый ТаблицаЗначений;
	ТД.Колонки.Добавить("БанковскийСчетКасса");
	ТД.Колонки.Добавить("Валюта");
	ТД.Колонки.Добавить("ВидДвижения");
	ТД.Колонки.Добавить("ВидДвиженияУправленческий");
	ТД.Колонки.Добавить("НомерСтроки");
	ТД.Колонки.Добавить("Организация");
	ТД.Колонки.Добавить("Период");
	ТД.Колонки.Добавить("Порядок");
	ТД.Колонки.Добавить("СодержаниеПроводки");
	ТД.Колонки.Добавить("Статья");
	ТД.Колонки.Добавить("Сумма");
	ТД.Колонки.Добавить("СуммаВал");
	ТД.Колонки.Добавить("СчетУчета");
	ТД.Колонки.Добавить("ТипДенежныхСредств");
	
	НовСтрока = ТД.Добавить();
	НовСтрока.БанковскийСчетКасса       = ДокументСсылкаРасходСоСчета.БанковскийСчет1;
	НовСтрока.Валюта                    = ДокументСсылкаРасходСоСчета.БанковскийСчет1.ВалютаДенежныхСредств;
	НовСтрока.ВидДвижения               = ВидДвиженияНакопления.Расход;
	НовСтрока.ВидДвиженияУправленческий = ВидДвиженияБухгалтерии.Кредит;
	НовСтрока.НомерСтроки               = 1;
	НовСтрока.Организация               = ДокументСсылкаРасходСоСчета.Организация;
	НовСтрока.Период                    = ДокументСсылкаРасходСоСчета.Дата;
	НовСтрока.Порядок                   = 1;
	НовСтрока.СодержаниеПроводки        = "Расход денежных средств";
	НовСтрока.Статья                    = Неопределено;
	
	ВалютаУчета = Константы.ВалютаУчета.Получить();					
	
	ВалютаУчетаКурс = AzRyFunctions.ПолучитьКурсВалюты(ВалютаУчета, ДокументСсылкаРасходСоСчета.Дата);
	ВалютаКурс      = AzRyFunctions.ПолучитьКурсВалюты(ДокументСсылкаРасходСоСчета.БанковскийСчет1.ВалютаДенежныхСредств, ДокументСсылкаРасходСоСчета.Дата);
	
	Сумма    = AzRyFunctions.ПересчитатьПоКурсу(ДокументСсылкаРасходСоСчета.Сумма1, ВалютаКурс, ВалютаУчетаКурс); 
	СуммаВал = ДокументСсылкаРасходСоСчета.Сумма1; 
	
	НовСтрока.Сумма                     = Сумма;
	НовСтрока.СуммаВал                  = СуммаВал;
	НовСтрока.СчетУчета                 = ПланыСчетов.Управленческий.Банк;
	НовСтрока.ТипДенежныхСредств        = Перечисления.ТипыДенежныхСредств.Безналичные;
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаДенежныеСредства", ТД);
	
КонецПроцедуры // СформироватьТаблицаДенежныеСредстваРасходСоСчета()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаУправленческийРасходСоСчета(ДокументСсылкаРасходСоСчета, СтруктураДополнительныеСвойства)
	
	ВалютаУчета = Константы.ВалютаУчета.Получить();
	
	ТД = Новый ТаблицаЗначений;
	ТД.Колонки.Добавить("ВалютаДт");
	ТД.Колонки.Добавить("ВалютаКт");
	ТД.Колонки.Добавить("НомерСтроки");
	ТД.Колонки.Добавить("Организация");
	ТД.Колонки.Добавить("Период");
	ТД.Колонки.Добавить("ПериодПланирования");
	ТД.Колонки.Добавить("Порядок");
	ТД.Колонки.Добавить("Содержание");
	ТД.Колонки.Добавить("Сумма");
	ТД.Колонки.Добавить("СуммаВалДт");
	ТД.Колонки.Добавить("СуммаВалКт");
	ТД.Колонки.Добавить("СчетДт");
	ТД.Колонки.Добавить("СчетКт");
	
	НовСтрока = ТД.Добавить();
	//НовСтрока.ВалютаДт    = ВалютаУчета;
	//НовСтрока.ВалютаКт    = ВалютаУчета;
	НовСтрока.НомерСтроки = 1;
	НовСтрока.Организация = ДокументСсылкаРасходСоСчета.Организация;
	НовСтрока.Период      = ДокументСсылкаРасходСоСчета.Дата;
	НовСтрока.ПериодПланирования = Справочники.ПериодыПланирования.Фактический;
	НовСтрока.Порядок            = 1;
	НовСтрока.Содержание         = "Списание денежных средств на произвольный счет";
	
	//ИспВалУчета = ВалютаУчета = ДокументСсылкаРасходСоСчета.БанковскийСчет1.ВалютаДенежныхСредств;
	
	ВалютаУчетаКурс = AzRyFunctions.ПолучитьКурсВалюты(ВалютаУчета, ДокументСсылкаРасходСоСчета.Дата);
	ВалютаКурс      = AzRyFunctions.ПолучитьКурсВалюты(ДокументСсылкаРасходСоСчета.БанковскийСчет1.ВалютаДенежныхСредств, ДокументСсылкаРасходСоСчета.Дата);
	                                   
	Сумма = AzRyFunctions.ПересчитатьПоКурсу(ДокументСсылкаРасходСоСчета.Сумма1, ВалютаКурс, ВалютаУчетаКурс); 
	
	//Если ИспВалУчета Тогда  
	//	Сумма = ДокументСсылкаРасходСоСчета.Сумма1;
	//Иначе 	
	//	Сумма = ДокументСсылкаРасходСоСчета.Сумма2;
	//КонецЕсли;
	
	НовСтрока.Сумма              = Сумма;
	//НовСтрока.СуммаВалДт         = ДокументСсылкаРасходСоСчета.Сумма1;
	//НовСтрока.СуммаВалКт         = ДокументСсылкаРасходСоСчета.Сумма1;
	НовСтрока.СчетДт             = ДокументСсылкаРасходСоСчета.СчетДебетРасход;
	НовСтрока.СчетКт             = ДокументСсылкаРасходСоСчета.БанковскийСчет1.СчетУчета;
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаУправленческий", ТД);
	
КонецПроцедуры // СформироватьТаблицаУправленческийРасходСоСчета()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаПлатежныйКалендарьРасходСоСчета(ДокументСсылкаРасходСоСчета, СтруктураДополнительныеСвойства)
		
	ТД = Новый ТаблицаЗначений;
	ТД.Колонки.Добавить("БанковскийСчетКасса");
	ТД.Колонки.Добавить("Валюта");
	ТД.Колонки.Добавить("НомерСтроки");
	ТД.Колонки.Добавить("Организация");
	ТД.Колонки.Добавить("Период");
	ТД.Колонки.Добавить("Порядок");
	ТД.Колонки.Добавить("СтатусУтвержденияПлатежа");
	ТД.Колонки.Добавить("Статья");
	ТД.Колонки.Добавить("СуммаОплаты");
	ТД.Колонки.Добавить("СчетНаОплату");
	ТД.Колонки.Добавить("ТипДенежныхСредств");
	
	НовСтрока = ТД.Добавить();
	НовСтрока.БанковскийСчетКасса      = ДокументСсылкаРасходСоСчета.БанковскийСчет1;
	НовСтрока.Валюта                   = ДокументСсылкаРасходСоСчета.БанковскийСчет1.ВалютаДенежныхСредств;
	НовСтрока.НомерСтроки              = 1;
	НовСтрока.Организация              = ДокументСсылкаРасходСоСчета.Организация;
	НовСтрока.Период                   = ДокументСсылкаРасходСоСчета.Дата;
	НовСтрока.Порядок                  = 2;
	НовСтрока.СтатусУтвержденияПлатежа = Перечисления.СтатусыУтвержденияПлатежей.Утвержден;
	НовСтрока.Статья                   = Неопределено;
	НовСтрока.СуммаОплаты              = - ДокументСсылкаРасходСоСчета.Сумма1;
	НовСтрока.СчетНаОплату             = Неопределено;
	НовСтрока.ТипДенежныхСредств       = Перечисления.ТипыДенежныхСредств.Безналичные;
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаПлатежныйКалендарь", ТД);
	
КонецПроцедуры // СформироватьТаблицаПлатежныйКалендарьРасходСоСчета()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаДоходыИРасходыРасходСоСчета(ДокументСсылкаРасходСоСчета, СтруктураДополнительныеСвойства)
		
	ТД = Новый ТаблицаЗначений;
	ТД.Колонки.Добавить("ЗаказПокупателя");
	ТД.Колонки.Добавить("НаправлениеДеятельности");
	ТД.Колонки.Добавить("НомерСтроки");
	ТД.Колонки.Добавить("Организация");
	ТД.Колонки.Добавить("Период");
	ТД.Колонки.Добавить("Порядок");
	ТД.Колонки.Добавить("СодержаниеПроводки");
	ТД.Колонки.Добавить("СтруктурнаяЕдиница");
	ТД.Колонки.Добавить("Сумма");
	ТД.Колонки.Добавить("СуммаДоходов");
	ТД.Колонки.Добавить("СуммаРасходов");
	ТД.Колонки.Добавить("СчетУчета");
	
	НовСтрока = ТД.Добавить();
	НовСтрока.ЗаказПокупателя          = Неопределено;
	НовСтрока.НаправлениеДеятельности  = Справочники.НаправленияДеятельности.Прочее;
	НовСтрока.НомерСтроки              = 1;
	НовСтрока.Организация              = ДокументСсылкаРасходСоСчета.Организация;
	НовСтрока.Период                   = ДокументСсылкаРасходСоСчета.Дата;
	НовСтрока.Порядок                  = 1;
	НовСтрока.СодержаниеПроводки       = "Отражение расходов";
	НовСтрока.СтруктурнаяЕдиница       = Неопределено;
	
	ВалютаУчета = Константы.ВалютаУчета.Получить();			
	
	ВалютаУчетаКурс = AzRyFunctions.ПолучитьКурсВалюты(ВалютаУчета, ДокументСсылкаРасходСоСчета.Дата);
	ВалютаКурс      = AzRyFunctions.ПолучитьКурсВалюты(ДокументСсылкаРасходСоСчета.БанковскийСчет1.ВалютаДенежныхСредств, ДокументСсылкаРасходСоСчета.Дата);
	
	Сумма    = AzRyFunctions.ПересчитатьПоКурсу(ДокументСсылкаРасходСоСчета.Сумма1, ВалютаКурс, ВалютаУчетаКурс); 
	
	НовСтрока.Сумма                    = Сумма;
	НовСтрока.СуммаДоходов             = 0;
	НовСтрока.СуммаРасходов            = Сумма;
	НовСтрока.СчетУчета                = ДокументСсылкаРасходСоСчета.СчетДебетРасход;
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаДоходыИРасходы", ТД);
	
КонецПроцедуры // СформироватьТаблицаДоходыИРасходыРасходСоСчета()


///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// ПОСТУПЛЕНИЕ НА СЧЕТ

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаДенежныеСредстваПоступлениеНаСчет(ДокументСсылкаПоступлениеНаСчет, СтруктураДополнительныеСвойства)
	
    ТД = Новый ТаблицаЗначений;
	ТД.Колонки.Добавить("БанковскийСчетКасса");
	ТД.Колонки.Добавить("Валюта");
	ТД.Колонки.Добавить("ВидДвижения");
	ТД.Колонки.Добавить("НомерСтроки");
	ТД.Колонки.Добавить("Организация");
	ТД.Колонки.Добавить("Период");
	ТД.Колонки.Добавить("Порядок");
	ТД.Колонки.Добавить("СодержаниеПроводки");
	ТД.Колонки.Добавить("Статья");
	ТД.Колонки.Добавить("Сумма");
	ТД.Колонки.Добавить("СуммаВал");
	ТД.Колонки.Добавить("СчетУчета");
	ТД.Колонки.Добавить("ТипДенежныхСредств");
	
	НовСтрока = ТД.Добавить();
	НовСтрока.БанковскийСчетКасса       = ДокументСсылкаПоступлениеНаСчет.БанковскийСчет2;
	НовСтрока.Валюта                    = ДокументСсылкаПоступлениеНаСчет.БанковскийСчет2.ВалютаДенежныхСредств;
	НовСтрока.ВидДвижения               = ВидДвиженияНакопления.Приход;
	НовСтрока.НомерСтроки               = 1;
	НовСтрока.Организация               = ДокументСсылкаПоступлениеНаСчет.Организация;
	НовСтрока.Период                    = ДокументСсылкаПоступлениеНаСчет.Дата;
	НовСтрока.Порядок                   = 1;
	НовСтрока.СодержаниеПроводки        = "Поступление денежных средств";
	НовСтрока.Статья                    = Неопределено;
	
	ВалютаУчета = Константы.ВалютаУчета.Получить();					
	
	ВалютаУчетаКурс = AzRyFunctions.ПолучитьКурсВалюты(ВалютаУчета, ДокументСсылкаПоступлениеНаСчет.Дата);
	ВалютаКурс      = AzRyFunctions.ПолучитьКурсВалюты(ДокументСсылкаПоступлениеНаСчет.БанковскийСчет2.ВалютаДенежныхСредств, ДокументСсылкаПоступлениеНаСчет.Дата);
	
	Сумма    = AzRyFunctions.ПересчитатьПоКурсу(ДокументСсылкаПоступлениеНаСчет.Сумма2, ВалютаКурс, ВалютаУчетаКурс); 
	СуммаВал = ДокументСсылкаПоступлениеНаСчет.Сумма2; 
	
	НовСтрока.Сумма                     = Сумма;
	НовСтрока.СуммаВал                  = СуммаВал;
	НовСтрока.СчетУчета                 = ПланыСчетов.Управленческий.Банк;
	НовСтрока.ТипДенежныхСредств        = Перечисления.ТипыДенежныхСредств.Безналичные;

	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаДенежныеСредства", ТД);
	
КонецПроцедуры // СформироватьТаблицаДенежныеСредстваПоступлениеНаСчет()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаПлатежныйКалендарьПоступлениеНаСчет(ДокументСсылкаПоступлениеНаСчет, СтруктураДополнительныеСвойства)
		
	ТД = Новый ТаблицаЗначений;
	ТД.Колонки.Добавить("БанковскийСчетКасса");
	ТД.Колонки.Добавить("Валюта");
	ТД.Колонки.Добавить("НомерСтроки");
	ТД.Колонки.Добавить("Организация");
	ТД.Колонки.Добавить("Период");
	ТД.Колонки.Добавить("Порядок");
	ТД.Колонки.Добавить("СтатусУтвержденияПлатежа");
	ТД.Колонки.Добавить("Статья");
	ТД.Колонки.Добавить("СуммаОплаты");
	ТД.Колонки.Добавить("СчетНаОплату");
	ТД.Колонки.Добавить("ТипДенежныхСредств");
	
	НовСтрока = ТД.Добавить();
	НовСтрока.БанковскийСчетКасса      = ДокументСсылкаПоступлениеНаСчет.БанковскийСчет2;
	НовСтрока.Валюта                   = ДокументСсылкаПоступлениеНаСчет.БанковскийСчет2.ВалютаДенежныхСредств;
	НовСтрока.НомерСтроки              = 1;
	НовСтрока.Организация              = ДокументСсылкаПоступлениеНаСчет.Организация;
	НовСтрока.Период                   = ДокументСсылкаПоступлениеНаСчет.Дата;
	НовСтрока.Порядок                  = 2;
	НовСтрока.СтатусУтвержденияПлатежа = Перечисления.СтатусыУтвержденияПлатежей.Утвержден;
	НовСтрока.Статья                   = Неопределено;
	НовСтрока.СуммаОплаты              = ДокументСсылкаПоступлениеНаСчет.Сумма2;
	НовСтрока.СчетНаОплату             = Неопределено;
	НовСтрока.ТипДенежныхСредств       = Перечисления.ТипыДенежныхСредств.Безналичные;
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаПлатежныйКалендарь", ТД);
	
КонецПроцедуры // СформироватьТаблицаПлатежныйКалендарьПоступлениеНаСчет()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаУправленческийПоступлениеНаСчет(ДокументСсылкаПоступлениеНаСчет, СтруктураДополнительныеСвойства)
	
	ВалютаУчета = Константы.ВалютаУчета.Получить();
	
	ТД = Новый ТаблицаЗначений;
	ТД.Колонки.Добавить("ВалютаДт");
	ТД.Колонки.Добавить("ВалютаКт");
	ТД.Колонки.Добавить("НомерСтроки");
	ТД.Колонки.Добавить("Организация");
	ТД.Колонки.Добавить("Период");
	ТД.Колонки.Добавить("ПериодПланирования");
	ТД.Колонки.Добавить("Порядок");
	ТД.Колонки.Добавить("Содержание");
	ТД.Колонки.Добавить("Сумма");
	ТД.Колонки.Добавить("СуммаВалДт");
	ТД.Колонки.Добавить("СуммаВалКт");
	ТД.Колонки.Добавить("СчетДт");
	ТД.Колонки.Добавить("СчетКт");
	
	НовСтрока = ТД.Добавить();
	//НовСтрока.ВалютаДт    = ДокументСсылкаРасходСоСчета.БанковскийСчет2.ВалютаДенежныхСредств;
	//НовСтрока.ВалютаКт    = ДокументСсылкаРасходСоСчета.БанковскийСчет2.ВалютаДенежныхСредств;
	НовСтрока.НомерСтроки = 1;
	НовСтрока.Организация = ДокументСсылкаПоступлениеНаСчет.Организация;
	НовСтрока.Период      = ДокументСсылкаПоступлениеНаСчет.Дата;
	НовСтрока.ПериодПланирования = Справочники.ПериодыПланирования.Фактический;
	НовСтрока.Порядок            = 1;
	НовСтрока.Содержание         = "Покупка валюты";
	
	
	//ИспВалУчета = ВалютаУчета = ДокументСсылкаРасходСоСчета.БанковскийСчет2.ВалютаДенежныхСредств;
	                                                                                
	ВалютаУчетаКурс = AzRyFunctions.ПолучитьКурсВалюты(ВалютаУчета, ДокументСсылкаПоступлениеНаСчет.Дата);
	ВалютаКурс      = AzRyFunctions.ПолучитьКурсВалюты(ДокументСсылкаПоступлениеНаСчет.БанковскийСчет2.ВалютаДенежныхСредств, ДокументСсылкаПоступлениеНаСчет.Дата);
	
	Сумма = AzRyFunctions.ПересчитатьПоКурсу(ДокументСсылкаПоступлениеНаСчет.Сумма2, ВалютаКурс, ВалютаУчетаКурс); 
		
	НовСтрока.Сумма              = Сумма;
	//НовСтрока.СуммаВалДт         = СуммаВалДт;
	//НовСтрока.СуммаВалКт         = СуммаВалКт;
	НовСтрока.СчетДт             = ДокументСсылкаПоступлениеНаСчет.БанковскийСчет2.СчетУчета;
	НовСтрока.СчетКт             = ДокументСсылкаПоступлениеНаСчет.СчетКредитПриход;
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаУправленческий", ТД);
	
КонецПроцедуры // СформироватьТаблицаУправленческийПоступлениеНаСчет()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаДоходыИРасходыПоступлениеНаСчет(ДокументСсылкаПоступлениеНаСчет, СтруктураДополнительныеСвойства)
		
	ТД = Новый ТаблицаЗначений;
	ТД.Колонки.Добавить("ЗаказПокупателя");
	ТД.Колонки.Добавить("НаправлениеДеятельности");
	ТД.Колонки.Добавить("НомерСтроки");
	ТД.Колонки.Добавить("Организация");
	ТД.Колонки.Добавить("Период");
	ТД.Колонки.Добавить("Порядок");
	ТД.Колонки.Добавить("СодержаниеПроводки");
	ТД.Колонки.Добавить("СтруктурнаяЕдиница");
	ТД.Колонки.Добавить("Сумма");
	ТД.Колонки.Добавить("СуммаДоходов");
	ТД.Колонки.Добавить("СуммаРасходов");
	ТД.Колонки.Добавить("СчетУчета");
	
	НовСтрока = ТД.Добавить();
	НовСтрока.ЗаказПокупателя          = Неопределено;
	НовСтрока.НаправлениеДеятельности  = Справочники.НаправленияДеятельности.Прочее;
	НовСтрока.НомерСтроки              = 1;
	НовСтрока.Организация              = ДокументСсылкаПоступлениеНаСчет.Организация;
	НовСтрока.Период                   = ДокументСсылкаПоступлениеНаСчет.Дата;
	НовСтрока.Порядок                  = 1;
	НовСтрока.СодержаниеПроводки       = "Отражение доходов";
	НовСтрока.СтруктурнаяЕдиница       = Неопределено;
	
	ВалютаУчета = Константы.ВалютаУчета.Получить();			
	
	ВалютаУчетаКурс = AzRyFunctions.ПолучитьКурсВалюты(ВалютаУчета, ДокументСсылкаПоступлениеНаСчет.Дата);
	ВалютаКурс      = AzRyFunctions.ПолучитьКурсВалюты(ДокументСсылкаПоступлениеНаСчет.БанковскийСчет2.ВалютаДенежныхСредств, ДокументСсылкаПоступлениеНаСчет.Дата);
	
	Сумма    = AzRyFunctions.ПересчитатьПоКурсу(ДокументСсылкаПоступлениеНаСчет.Сумма2, ВалютаКурс, ВалютаУчетаКурс); 
	
	НовСтрока.Сумма                    = Сумма;
	НовСтрока.СуммаДоходов             = Сумма;
	НовСтрока.СуммаРасходов            = 0;
	НовСтрока.СчетУчета                = ДокументСсылкаПоступлениеНаСчет.СчетКредитПриход;
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаДоходыИРасходы", ТД);
	
КонецПроцедуры // СформироватьТаблицаДоходыИРасходыПоступлениеНаСчет()

///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// РАСХОД ИЗ КАССЫ

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаДенежныеСредстваРасходИзКассы(ДокументСсылкаРасходИзКассы, СтруктураДополнительныеСвойства)
			
	ТД = Новый ТаблицаЗначений;
	ТД.Колонки.Добавить("БанковскийСчетКасса");
	ТД.Колонки.Добавить("Валюта");
	ТД.Колонки.Добавить("ВидДвижения");
	ТД.Колонки.Добавить("ВидДвиженияУправленческий");
	ТД.Колонки.Добавить("НомерСтроки");
	ТД.Колонки.Добавить("Организация");
	ТД.Колонки.Добавить("Период");
	ТД.Колонки.Добавить("Порядок");
	ТД.Колонки.Добавить("СодержаниеПроводки");
	ТД.Колонки.Добавить("Статья");
	ТД.Колонки.Добавить("Сумма");
	ТД.Колонки.Добавить("СуммаВал");
	ТД.Колонки.Добавить("СчетУчета");
	ТД.Колонки.Добавить("ТипДенежныхСредств");
	
	НовСтрока = ТД.Добавить();
	НовСтрока.БанковскийСчетКасса       = ДокументСсылкаРасходИзКассы.Касса1;
	НовСтрока.Валюта                    = ДокументСсылкаРасходИзКассы.Касса1.ВалютаПоУмолчанию;
	НовСтрока.ВидДвижения               = ВидДвиженияНакопления.Расход;
	НовСтрока.ВидДвиженияУправленческий = ВидДвиженияБухгалтерии.Кредит;
	НовСтрока.НомерСтроки               = 1;
	НовСтрока.Организация               = ДокументСсылкаРасходИзКассы.Организация;
	НовСтрока.Период                    = ДокументСсылкаРасходИзКассы.Дата;
	НовСтрока.Порядок                   = 1;
	НовСтрока.СодержаниеПроводки        = "Расход денежных средств";
	НовСтрока.Статья                    = Неопределено;
	
	ВалютаУчета = Константы.ВалютаУчета.Получить();				
	
	ВалютаУчетаКурс = AzRyFunctions.ПолучитьКурсВалюты(ВалютаУчета, ДокументСсылкаРасходИзКассы.Дата);
	ВалютаКурс      = AzRyFunctions.ПолучитьКурсВалюты(ДокументСсылкаРасходИзКассы.Касса1.ВалютаПоУмолчанию, ДокументСсылкаРасходИзКассы.Дата);
	
	Сумма    = AzRyFunctions.ПересчитатьПоКурсу(ДокументСсылкаРасходИзКассы.Сумма1, ВалютаКурс, ВалютаУчетаКурс); 
	СуммаВал = ДокументСсылкаРасходИзКассы.Сумма1; 
	
	НовСтрока.Сумма                     = Сумма;
	НовСтрока.СуммаВал                  = СуммаВал;
	НовСтрока.СчетУчета                 = ПланыСчетов.Управленческий.Банк;
	НовСтрока.ТипДенежныхСредств        = ?(ДокументСсылкаРасходИзКассы.ТипыКонвертацияВалюты = Перечисления.AzRyТипыКонвертацияВалюты.Наличные, Перечисления.ТипыДенежныхСредств.Наличные, Перечисления.ТипыДенежныхСредств.Безналичные);
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаДенежныеСредства", ТД);
	
КонецПроцедуры // СформироватьТаблицаДенежныеСредстваРасходИзКассы()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаУправленческийРасходИзКассы(ДокументСсылкаРасходИзКассы, СтруктураДополнительныеСвойства)
	
	ВалютаУчета = Константы.ВалютаУчета.Получить();
	
	ТД = Новый ТаблицаЗначений;
	ТД.Колонки.Добавить("ВалютаДт");
	ТД.Колонки.Добавить("ВалютаКт");
	ТД.Колонки.Добавить("НомерСтроки");
	ТД.Колонки.Добавить("Организация");
	ТД.Колонки.Добавить("Период");
	ТД.Колонки.Добавить("ПериодПланирования");
	ТД.Колонки.Добавить("Порядок");
	ТД.Колонки.Добавить("Содержание");
	ТД.Колонки.Добавить("Сумма");
	ТД.Колонки.Добавить("СуммаВалДт");
	ТД.Колонки.Добавить("СуммаВалКт");
	ТД.Колонки.Добавить("СчетДт");
	ТД.Колонки.Добавить("СчетКт");
	
	НовСтрока = ТД.Добавить();
	//НовСтрока.ВалютаДт    = ВалютаУчета;
	//НовСтрока.ВалютаКт    = ВалютаУчета;
	НовСтрока.НомерСтроки = 1;
	НовСтрока.Организация = ДокументСсылкаРасходИзКассы.Организация;
	НовСтрока.Период      = ДокументСсылкаРасходИзКассы.Дата;
	НовСтрока.ПериодПланирования = Справочники.ПериодыПланирования.Фактический;
	НовСтрока.Порядок            = 1;
	НовСтрока.Содержание         = "Списание денежных средств на произвольный счет";
	
	//ИспВалУчета = ВалютаУчета = ДокументСсылкаРасходСоСчета.БанковскийСчет1.ВалютаДенежныхСредств;
	
	ВалютаУчетаКурс = AzRyFunctions.ПолучитьКурсВалюты(ВалютаУчета, ДокументСсылкаРасходИзКассы.Дата);
	ВалютаКурс      = AzRyFunctions.ПолучитьКурсВалюты(ДокументСсылкаРасходИзКассы.Касса1.ВалютаПоУмолчанию, ДокументСсылкаРасходИзКассы.Дата);
	
	Сумма = AzRyFunctions.ПересчитатьПоКурсу(ДокументСсылкаРасходИзКассы.Сумма1, ВалютаКурс, ВалютаУчетаКурс); 
	
	НовСтрока.Сумма              = Сумма;
	//НовСтрока.СуммаВалДт         = ДокументСсылкаРасходСоСчета.Сумма1;
	//НовСтрока.СуммаВалКт         = ДокументСсылкаРасходСоСчета.Сумма1;
	НовСтрока.СчетДт             = ДокументСсылкаРасходИзКассы.СчетДебетРасход;
	НовСтрока.СчетКт             = ДокументСсылкаРасходИзКассы.Касса1.СчетУчета;
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаУправленческий", ТД);
	
КонецПроцедуры // СформироватьТаблицаУправленческийРасходИзКассы()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаПлатежныйКалендарьРасходИзКассы(ДокументСсылкаРасходИзКассы, СтруктураДополнительныеСвойства)
		
	ТД = Новый ТаблицаЗначений;
	ТД.Колонки.Добавить("БанковскийСчетКасса");
	ТД.Колонки.Добавить("Валюта");
	ТД.Колонки.Добавить("НомерСтроки");
	ТД.Колонки.Добавить("Организация");
	ТД.Колонки.Добавить("Период");
	ТД.Колонки.Добавить("Порядок");
	ТД.Колонки.Добавить("СтатусУтвержденияПлатежа");
	ТД.Колонки.Добавить("Статья");
	ТД.Колонки.Добавить("СуммаОплаты");
	ТД.Колонки.Добавить("СчетНаОплату");
	ТД.Колонки.Добавить("ТипДенежныхСредств");
	
	НовСтрока = ТД.Добавить();
	НовСтрока.БанковскийСчетКасса      = ДокументСсылкаРасходИзКассы.Касса1;
	НовСтрока.Валюта                   = ДокументСсылкаРасходИзКассы.Касса1.ВалютаПоУмолчанию;
	НовСтрока.НомерСтроки              = 1;
	НовСтрока.Организация              = ДокументСсылкаРасходИзКассы.Организация;
	НовСтрока.Период                   = ДокументСсылкаРасходИзКассы.Дата;
	НовСтрока.Порядок                  = 2;
	НовСтрока.СтатусУтвержденияПлатежа = Перечисления.СтатусыУтвержденияПлатежей.Утвержден;
	НовСтрока.Статья                   = Неопределено;
	НовСтрока.СуммаОплаты              = - ДокументСсылкаРасходИзКассы.Сумма1;
	НовСтрока.СчетНаОплату             = Неопределено;
	НовСтрока.ТипДенежныхСредств       = ?(ДокументСсылкаРасходИзКассы.ТипыКонвертацияВалюты = Перечисления.AzRyТипыКонвертацияВалюты.Наличные, Перечисления.ТипыДенежныхСредств.Наличные, Перечисления.ТипыДенежныхСредств.Безналичные);
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаПлатежныйКалендарь", ТД);
	
КонецПроцедуры // СформироватьТаблицаПлатежныйКалендарьРасходИзКассы()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаДоходыИРасходыРасходИзКассы(ДокументСсылкаРасходИзКассы, СтруктураДополнительныеСвойства)
		
	ТД = Новый ТаблицаЗначений;
	ТД.Колонки.Добавить("ЗаказПокупателя");
	ТД.Колонки.Добавить("НаправлениеДеятельности");
	ТД.Колонки.Добавить("НомерСтроки");
	ТД.Колонки.Добавить("Организация");
	ТД.Колонки.Добавить("Период");
	ТД.Колонки.Добавить("Порядок");
	ТД.Колонки.Добавить("СодержаниеПроводки");
	ТД.Колонки.Добавить("СтруктурнаяЕдиница");
	ТД.Колонки.Добавить("Сумма");
	ТД.Колонки.Добавить("СуммаДоходов");
	ТД.Колонки.Добавить("СуммаРасходов");
	ТД.Колонки.Добавить("СчетУчета");
	
	НовСтрока = ТД.Добавить();
	НовСтрока.ЗаказПокупателя          = Неопределено;
	НовСтрока.НаправлениеДеятельности  = Справочники.НаправленияДеятельности.Прочее;
	НовСтрока.НомерСтроки              = 1;
	НовСтрока.Организация              = ДокументСсылкаРасходИзКассы.Организация;
	НовСтрока.Период                   = ДокументСсылкаРасходИзКассы.Дата;
	НовСтрока.Порядок                  = 1;
	НовСтрока.СодержаниеПроводки       = "Отражение расходов";
	НовСтрока.СтруктурнаяЕдиница       = Неопределено;
	
	ВалютаУчета = Константы.ВалютаУчета.Получить();			
	
	ВалютаУчетаКурс = AzRyFunctions.ПолучитьКурсВалюты(ВалютаУчета, ДокументСсылкаРасходИзКассы.Дата);
	ВалютаКурс      = AzRyFunctions.ПолучитьКурсВалюты(ДокументСсылкаРасходИзКассы.Касса1.ВалютаПоУмолчанию, ДокументСсылкаРасходИзКассы.Дата);
	
	Сумма           = AzRyFunctions.ПересчитатьПоКурсу(ДокументСсылкаРасходИзКассы.Сумма1, ВалютаКурс, ВалютаУчетаКурс); 
	
	НовСтрока.Сумма                    = Сумма;
	НовСтрока.СуммаДоходов             = 0;
	НовСтрока.СуммаРасходов            = Сумма;
	НовСтрока.СчетУчета                = ДокументСсылкаРасходИзКассы.СчетДебетРасход;
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаДоходыИРасходы", ТД);
	
КонецПроцедуры // СформироватьТаблицаДоходыИРасходыРасходИзКассы()

///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// ПОСТУПЛЕНИЕ В КАССУ

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаДенежныеСредстваПоступлениеВКассу(ДокументСсылкаПоступлениеВКассу, СтруктураДополнительныеСвойства)
	
    ТД = Новый ТаблицаЗначений;
	ТД.Колонки.Добавить("БанковскийСчетКасса");
	ТД.Колонки.Добавить("Валюта");
	ТД.Колонки.Добавить("ВидДвижения");
	ТД.Колонки.Добавить("НомерСтроки");
	ТД.Колонки.Добавить("Организация");
	ТД.Колонки.Добавить("Период");
	ТД.Колонки.Добавить("Порядок");
	ТД.Колонки.Добавить("СодержаниеПроводки");
	ТД.Колонки.Добавить("Статья");
	ТД.Колонки.Добавить("Сумма");
	ТД.Колонки.Добавить("СуммаВал");
	ТД.Колонки.Добавить("СчетУчета");
	ТД.Колонки.Добавить("ТипДенежныхСредств");
	
	НовСтрока = ТД.Добавить();
	НовСтрока.БанковскийСчетКасса       = ДокументСсылкаПоступлениеВКассу.Касса2;
	НовСтрока.Валюта                    = ДокументСсылкаПоступлениеВКассу.Касса2.ВалютаПоУмолчанию;
	НовСтрока.ВидДвижения               = ВидДвиженияНакопления.Приход;
	НовСтрока.НомерСтроки               = 1;
	НовСтрока.Организация               = ДокументСсылкаПоступлениеВКассу.Организация;
	НовСтрока.Период                    = ДокументСсылкаПоступлениеВКассу.Дата;
	НовСтрока.Порядок                   = 1;
	НовСтрока.СодержаниеПроводки        = "Поступление денежных средств";
	НовСтрока.Статья                    = Неопределено;
	
	ВалютаУчета = Константы.ВалютаУчета.Получить();					
	
	ВалютаУчетаКурс = AzRyFunctions.ПолучитьКурсВалюты(ВалютаУчета, ДокументСсылкаПоступлениеВКассу.Дата);
	ВалютаКурс      = AzRyFunctions.ПолучитьКурсВалюты(ДокументСсылкаПоступлениеВКассу.Касса2.ВалютаПоУмолчанию, ДокументСсылкаПоступлениеВКассу.Дата);
	
	Сумма    = AzRyFunctions.ПересчитатьПоКурсу(ДокументСсылкаПоступлениеВКассу.Сумма2, ВалютаКурс, ВалютаУчетаКурс); 
	СуммаВал = ДокументСсылкаПоступлениеВКассу.Сумма2; 
	
	НовСтрока.Сумма                     = Сумма;
	НовСтрока.СуммаВал                  = СуммаВал;
	НовСтрока.СчетУчета                 = ПланыСчетов.Управленческий.Банк;
	НовСтрока.ТипДенежныхСредств        = ?(ДокументСсылкаПоступлениеВКассу.ТипыКонвертацияВалюты = Перечисления.AzRyТипыКонвертацияВалюты.Наличные, Перечисления.ТипыДенежныхСредств.Наличные, Перечисления.ТипыДенежныхСредств.Безналичные);

	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаДенежныеСредства", ТД);
	
КонецПроцедуры // СформироватьТаблицаДенежныеСредстваПоступлениеВКассу()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаПлатежныйКалендарьПоступлениеВКассу(ДокументСсылкаПоступлениеВКассу, СтруктураДополнительныеСвойства)
		
	ТД = Новый ТаблицаЗначений;
	ТД.Колонки.Добавить("БанковскийСчетКасса");
	ТД.Колонки.Добавить("Валюта");
	ТД.Колонки.Добавить("НомерСтроки");
	ТД.Колонки.Добавить("Организация");
	ТД.Колонки.Добавить("Период");
	ТД.Колонки.Добавить("Порядок");
	ТД.Колонки.Добавить("СтатусУтвержденияПлатежа");
	ТД.Колонки.Добавить("Статья");
	ТД.Колонки.Добавить("СуммаОплаты");
	ТД.Колонки.Добавить("СчетНаОплату");
	ТД.Колонки.Добавить("ТипДенежныхСредств");
	
	НовСтрока = ТД.Добавить();
	НовСтрока.БанковскийСчетКасса      = ДокументСсылкаПоступлениеВКассу.Касса2;
	НовСтрока.Валюта                   = ДокументСсылкаПоступлениеВКассу.Касса2.ВалютаПоУмолчанию;
	НовСтрока.НомерСтроки              = 1;
	НовСтрока.Организация              = ДокументСсылкаПоступлениеВКассу.Организация;
	НовСтрока.Период                   = ДокументСсылкаПоступлениеВКассу.Дата;
	НовСтрока.Порядок                  = 2;
	НовСтрока.СтатусУтвержденияПлатежа = Перечисления.СтатусыУтвержденияПлатежей.Утвержден;
	НовСтрока.Статья                   = Неопределено;
	НовСтрока.СуммаОплаты              = ДокументСсылкаПоступлениеВКассу.Сумма2;
	НовСтрока.СчетНаОплату             = Неопределено;
	НовСтрока.ТипДенежныхСредств       = ?(ДокументСсылкаПоступлениеВКассу.ТипыКонвертацияВалюты = Перечисления.AzRyТипыКонвертацияВалюты.Наличные, Перечисления.ТипыДенежныхСредств.Наличные, Перечисления.ТипыДенежныхСредств.Безналичные);
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаПлатежныйКалендарь", ТД);
	
КонецПроцедуры // СформироватьТаблицаПлатежныйКалендарьПоступлениеВКассу()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаУправленческийПоступлениеВКассу(ДокументСсылкаПоступлениеВКассу, СтруктураДополнительныеСвойства)
	
	ВалютаУчета = Константы.ВалютаУчета.Получить();
	
	ТД = Новый ТаблицаЗначений;
	ТД.Колонки.Добавить("ВалютаДт");
	ТД.Колонки.Добавить("ВалютаКт");
	ТД.Колонки.Добавить("НомерСтроки");
	ТД.Колонки.Добавить("Организация");
	ТД.Колонки.Добавить("Период");
	ТД.Колонки.Добавить("ПериодПланирования");
	ТД.Колонки.Добавить("Порядок");
	ТД.Колонки.Добавить("Содержание");
	ТД.Колонки.Добавить("Сумма");
	ТД.Колонки.Добавить("СуммаВалДт");
	ТД.Колонки.Добавить("СуммаВалКт");
	ТД.Колонки.Добавить("СчетДт");
	ТД.Колонки.Добавить("СчетКт");
	
	НовСтрока = ТД.Добавить();
	//НовСтрока.ВалютаДт    = ДокументСсылкаРасходСоСчета.БанковскийСчет2.ВалютаДенежныхСредств;
	//НовСтрока.ВалютаКт    = ДокументСсылкаРасходСоСчета.БанковскийСчет2.ВалютаДенежныхСредств;
	НовСтрока.НомерСтроки = 1;
	НовСтрока.Организация = ДокументСсылкаПоступлениеВКассу.Организация;
	НовСтрока.Период      = ДокументСсылкаПоступлениеВКассу.Дата;
	НовСтрока.ПериодПланирования = Справочники.ПериодыПланирования.Фактический;
	НовСтрока.Порядок            = 1;
	НовСтрока.Содержание         = "Покупка валюты";
	
	
	//ИспВалУчета = ВалютаУчета = ДокументСсылкаРасходСоСчета.БанковскийСчет2.ВалютаДенежныхСредств;
	
	ВалютаУчетаКурс = AzRyFunctions.ПолучитьКурсВалюты(ВалютаУчета, ДокументСсылкаПоступлениеВКассу.Дата);
	ВалютаКурс      = AzRyFunctions.ПолучитьКурсВалюты(ДокументСсылкаПоступлениеВКассу.Касса2.ВалютаПоУмолчанию, ДокументСсылкаПоступлениеВКассу.Дата);
	
	Сумма = AzRyFunctions.ПересчитатьПоКурсу(ДокументСсылкаПоступлениеВКассу.Сумма2, ВалютаКурс, ВалютаУчетаКурс); 
		
	НовСтрока.Сумма              = Сумма;
	//НовСтрока.СуммаВалДт         = СуммаВалДт;
	//НовСтрока.СуммаВалКт         = СуммаВалКт;
	НовСтрока.СчетДт             = ДокументСсылкаПоступлениеВКассу.Касса2.СчетУчета;
	НовСтрока.СчетКт             = ДокументСсылкаПоступлениеВКассу.СчетКредитПриход;
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаУправленческий", ТД);
	
КонецПроцедуры // СформироватьТаблицаУправленческийПоступлениеВКассу()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаДоходыИРасходыПоступлениеВКассу(ДокументСсылкаПоступлениеВКассу, СтруктураДополнительныеСвойства)
		
	ТД = Новый ТаблицаЗначений;
	ТД.Колонки.Добавить("ЗаказПокупателя");
	ТД.Колонки.Добавить("НаправлениеДеятельности");
	ТД.Колонки.Добавить("НомерСтроки");
	ТД.Колонки.Добавить("Организация");
	ТД.Колонки.Добавить("Период");
	ТД.Колонки.Добавить("Порядок");
	ТД.Колонки.Добавить("СодержаниеПроводки");
	ТД.Колонки.Добавить("СтруктурнаяЕдиница");
	ТД.Колонки.Добавить("Сумма");
	ТД.Колонки.Добавить("СуммаДоходов");
	ТД.Колонки.Добавить("СуммаРасходов");
	ТД.Колонки.Добавить("СчетУчета");
	
	НовСтрока = ТД.Добавить();
	НовСтрока.ЗаказПокупателя          = Неопределено;
	НовСтрока.НаправлениеДеятельности  = Справочники.НаправленияДеятельности.Прочее;
	НовСтрока.НомерСтроки              = 1;
	НовСтрока.Организация              = ДокументСсылкаПоступлениеВКассу.Организация;
	НовСтрока.Период                   = ДокументСсылкаПоступлениеВКассу.Дата;
	НовСтрока.Порядок                  = 1;
	НовСтрока.СодержаниеПроводки       = "Отражение доходов";
	НовСтрока.СтруктурнаяЕдиница       = Неопределено;
	
	ВалютаУчета = Константы.ВалютаУчета.Получить();			
	
	ВалютаУчетаКурс = AzRyFunctions.ПолучитьКурсВалюты(ВалютаУчета, ДокументСсылкаПоступлениеВКассу.Дата);
	ВалютаКурс      = AzRyFunctions.ПолучитьКурсВалюты(ДокументСсылкаПоступлениеВКассу.Касса2.ВалютаПоУмолчанию, ДокументСсылкаПоступлениеВКассу.Дата);
	
	Сумма    = AzRyFunctions.ПересчитатьПоКурсу(ДокументСсылкаПоступлениеВКассу.Сумма2, ВалютаКурс, ВалютаУчетаКурс); 
	
	НовСтрока.Сумма                    = Сумма;
	НовСтрока.СуммаДоходов             = Сумма;
	НовСтрока.СуммаРасходов            = 0;
	НовСтрока.СчетУчета                = ДокументСсылкаПоступлениеВКассу.СчетКредитПриход;
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаДоходыИРасходы", ТД);
	
КонецПроцедуры // СформироватьТаблицаДоходыИРасходыПоступлениеВКассу()


// Инициализирует таблицы значений, содержащие данные табличных частей документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылкаAzRyКонвертацияВалюты, СтруктураДополнительныеСвойства, ТипОпераций) Экспорт
	
	Если ТипОпераций = "РасходСоСчета" Тогда  
		
		// Формирование таблиц движений по разделам учета.
		СформироватьТаблицаДенежныеСредстваРасходСоСчета(ДокументСсылкаAzRyКонвертацияВалюты, СтруктураДополнительныеСвойства);
		СформироватьТаблицаУправленческийРасходСоСчета(ДокументСсылкаAzRyКонвертацияВалюты, СтруктураДополнительныеСвойства);
		СформироватьТаблицаПлатежныйКалендарьРасходСоСчета(ДокументСсылкаAzRyКонвертацияВалюты, СтруктураДополнительныеСвойства);
		СформироватьТаблицаДоходыИРасходыРасходСоСчета(ДокументСсылкаAzRyКонвертацияВалюты, СтруктураДополнительныеСвойства);
		
	ИначеЕсли ТипОпераций = "ПоступлениеНаСчет" Тогда  
		
		// Формирование таблиц движений по разделам учета.
		СформироватьТаблицаДенежныеСредстваПоступлениеНаСчет(ДокументСсылкаAzRyКонвертацияВалюты, СтруктураДополнительныеСвойства);
		СформироватьТаблицаПлатежныйКалендарьПоступлениеНаСчет(ДокументСсылкаAzRyКонвертацияВалюты, СтруктураДополнительныеСвойства);
		СформироватьТаблицаУправленческийПоступлениеНаСчет(ДокументСсылкаAzRyКонвертацияВалюты, СтруктураДополнительныеСвойства);
		СформироватьТаблицаДоходыИРасходыПоступлениеНаСчет(ДокументСсылкаAzRyКонвертацияВалюты, СтруктураДополнительныеСвойства);
		
	ИначеЕсли ТипОпераций = "РасходИзКассы" Тогда  
		
		// Формирование таблиц движений по разделам учета.
		СформироватьТаблицаДенежныеСредстваРасходИзКассы(ДокументСсылкаAzRyКонвертацияВалюты, СтруктураДополнительныеСвойства);
		СформироватьТаблицаУправленческийРасходИзКассы(ДокументСсылкаAzRyКонвертацияВалюты, СтруктураДополнительныеСвойства);
		СформироватьТаблицаПлатежныйКалендарьРасходИзКассы(ДокументСсылкаAzRyКонвертацияВалюты, СтруктураДополнительныеСвойства);
		СформироватьТаблицаДоходыИРасходыРасходИзКассы(ДокументСсылкаAzRyКонвертацияВалюты, СтруктураДополнительныеСвойства);
		
	ИначеЕсли ТипОпераций = "ПоступлениеВКассу" Тогда  
		
		// Формирование таблиц движений по разделам учета.
		СформироватьТаблицаДенежныеСредстваПоступлениеВКассу(ДокументСсылкаAzRyКонвертацияВалюты, СтруктураДополнительныеСвойства);
		СформироватьТаблицаПлатежныйКалендарьПоступлениеВКассу(ДокументСсылкаAzRyКонвертацияВалюты, СтруктураДополнительныеСвойства);
		СформироватьТаблицаУправленческийПоступлениеВКассу(ДокументСсылкаAzRyКонвертацияВалюты, СтруктураДополнительныеСвойства);	
		СформироватьТаблицаДоходыИРасходыПоступлениеВКассу(ДокументСсылкаAzRyКонвертацияВалюты, СтруктураДополнительныеСвойства);
		
	КонецЕсли;
	
КонецПроцедуры // ИнициализироватьДанныеДокумента()


Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.AzRyКонвертацияВалюты.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	AzRyКонвертацияВалюты.Автор,
	|	AzRyКонвертацияВалюты.БанковскийСчет1,
	|	AzRyКонвертацияВалюты.БанковскийСчет2,
	|	AzRyКонвертацияВалюты.ВалютаОпераций,
	|	AzRyКонвертацияВалюты.ВидОперации,
	|	AzRyКонвертацияВалюты.Дата,
	|	AzRyКонвертацияВалюты.ДатаКурсаВалюты,
	|	AzRyКонвертацияВалюты.Договор,
	|	AzRyКонвертацияВалюты.Документ,
	|	AzRyКонвертацияВалюты.Заказ,
	|	AzRyКонвертацияВалюты.Комментарий,
	|	AzRyКонвертацияВалюты.Контрагент,
	|	AzRyКонвертацияВалюты.Корреспонденция,
	|	AzRyКонвертацияВалюты.Кратность,
	|	AzRyКонвертацияВалюты.Курс,
	|	AzRyКонвертацияВалюты.НалогообложениеНДС,
	|	AzRyКонвертацияВалюты.Номер,
	|	AzRyКонвертацияВалюты.Организация,
	|	AzRyКонвертацияВалюты.ПризнакАванса,
	|	AzRyКонвертацияВалюты.Статья,
	|	AzRyКонвертацияВалюты.Сумма1,
	|	AzRyКонвертацияВалюты.Сумма2,
	|	AzRyКонвертацияВалюты.СуммаПлатежа,
	|	AzRyКонвертацияВалюты.СуммаРасчетов,
	|	AzRyКонвертацияВалюты.СчетНаОплату
	|ИЗ
	|	Документ.AzRyКонвертацияВалюты КАК AzRyКонвертацияВалюты
	|ГДЕ
	|	AzRyКонвертацияВалюты.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
